
public class B16_random {

	public static void main(String[] args) {
		
		// 자바에서 무작위 숫자 생성하기
		// math.random();
		// double 타입의 랜덤 소수를 생성한다
		// 0 <= x < 1
		// 이 랜덤 소수를 이용하여 원하는 범위의 숫자를 만들 수 있다
		
		//원하는 범위의 숫자를 만드는 순서 ( 30 ~ 60)
		//1 생서된 랜덤 소수에 원하는 숫자의 개수를 곱한다 (31개)
		// (0 * 31 <= ㅌ < 1 * 31)
		//2 원하는 숫자 중 가장 작은 숫자를 더한다 
		// (0 * 31 + 30 <= x < 1 * 31 + 30)
		
		//3
//		for (int i = 0; i < 10; ++i){
//		System.out.println((int)(Math.random() * 31 + 30));
//		}
		
		//연습 문제 : 1부터 45의 랜덤 숫자를 7개 출력해보세요
		
		
		}
	}

}
